###################################################################

# Created by write_sdc on Wed Apr  8 17:09:05 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name enG5K -library fsa0m_a_generic_core_ss1p62v125c
set_load -pin_load 0.05 [get_ports {OUT_character[31]}]
set_load -pin_load 0.05 [get_ports {OUT_character[30]}]
set_load -pin_load 0.05 [get_ports {OUT_character[29]}]
set_load -pin_load 0.05 [get_ports {OUT_character[28]}]
set_load -pin_load 0.05 [get_ports {OUT_character[27]}]
set_load -pin_load 0.05 [get_ports {OUT_character[26]}]
set_load -pin_load 0.05 [get_ports {OUT_character[25]}]
set_load -pin_load 0.05 [get_ports {OUT_character[24]}]
set_load -pin_load 0.05 [get_ports {OUT_character[23]}]
set_load -pin_load 0.05 [get_ports {OUT_character[22]}]
set_load -pin_load 0.05 [get_ports {OUT_character[21]}]
set_load -pin_load 0.05 [get_ports {OUT_character[20]}]
set_load -pin_load 0.05 [get_ports {OUT_character[19]}]
set_load -pin_load 0.05 [get_ports {OUT_character[18]}]
set_load -pin_load 0.05 [get_ports {OUT_character[17]}]
set_load -pin_load 0.05 [get_ports {OUT_character[16]}]
set_load -pin_load 0.05 [get_ports {OUT_character[15]}]
set_load -pin_load 0.05 [get_ports {OUT_character[14]}]
set_load -pin_load 0.05 [get_ports {OUT_character[13]}]
set_load -pin_load 0.05 [get_ports {OUT_character[12]}]
set_load -pin_load 0.05 [get_ports {OUT_character[11]}]
set_load -pin_load 0.05 [get_ports {OUT_character[10]}]
set_load -pin_load 0.05 [get_ports {OUT_character[9]}]
set_load -pin_load 0.05 [get_ports {OUT_character[8]}]
set_load -pin_load 0.05 [get_ports {OUT_character[7]}]
set_load -pin_load 0.05 [get_ports {OUT_character[6]}]
set_load -pin_load 0.05 [get_ports {OUT_character[5]}]
set_load -pin_load 0.05 [get_ports {OUT_character[4]}]
set_load -pin_load 0.05 [get_ports {OUT_character[3]}]
set_load -pin_load 0.05 [get_ports {OUT_character[2]}]
set_load -pin_load 0.05 [get_ports {OUT_character[1]}]
set_load -pin_load 0.05 [get_ports {OUT_character[0]}]
set_max_capacitance 0.15 [get_ports {IN_character[31]}]
set_max_capacitance 0.15 [get_ports {IN_character[30]}]
set_max_capacitance 0.15 [get_ports {IN_character[29]}]
set_max_capacitance 0.15 [get_ports {IN_character[28]}]
set_max_capacitance 0.15 [get_ports {IN_character[27]}]
set_max_capacitance 0.15 [get_ports {IN_character[26]}]
set_max_capacitance 0.15 [get_ports {IN_character[25]}]
set_max_capacitance 0.15 [get_ports {IN_character[24]}]
set_max_capacitance 0.15 [get_ports {IN_character[23]}]
set_max_capacitance 0.15 [get_ports {IN_character[22]}]
set_max_capacitance 0.15 [get_ports {IN_character[21]}]
set_max_capacitance 0.15 [get_ports {IN_character[20]}]
set_max_capacitance 0.15 [get_ports {IN_character[19]}]
set_max_capacitance 0.15 [get_ports {IN_character[18]}]
set_max_capacitance 0.15 [get_ports {IN_character[17]}]
set_max_capacitance 0.15 [get_ports {IN_character[16]}]
set_max_capacitance 0.15 [get_ports {IN_character[15]}]
set_max_capacitance 0.15 [get_ports {IN_character[14]}]
set_max_capacitance 0.15 [get_ports {IN_character[13]}]
set_max_capacitance 0.15 [get_ports {IN_character[12]}]
set_max_capacitance 0.15 [get_ports {IN_character[11]}]
set_max_capacitance 0.15 [get_ports {IN_character[10]}]
set_max_capacitance 0.15 [get_ports {IN_character[9]}]
set_max_capacitance 0.15 [get_ports {IN_character[8]}]
set_max_capacitance 0.15 [get_ports {IN_character[7]}]
set_max_capacitance 0.15 [get_ports {IN_character[6]}]
set_max_capacitance 0.15 [get_ports {IN_character[5]}]
set_max_capacitance 0.15 [get_ports {IN_character[4]}]
set_max_capacitance 0.15 [get_ports {IN_character[3]}]
set_max_capacitance 0.15 [get_ports {IN_character[2]}]
set_max_capacitance 0.15 [get_ports {IN_character[1]}]
set_max_capacitance 0.15 [get_ports {IN_character[0]}]
set_max_capacitance 0.15 [get_ports {IN_weight[39]}]
set_max_capacitance 0.15 [get_ports {IN_weight[38]}]
set_max_capacitance 0.15 [get_ports {IN_weight[37]}]
set_max_capacitance 0.15 [get_ports {IN_weight[36]}]
set_max_capacitance 0.15 [get_ports {IN_weight[35]}]
set_max_capacitance 0.15 [get_ports {IN_weight[34]}]
set_max_capacitance 0.15 [get_ports {IN_weight[33]}]
set_max_capacitance 0.15 [get_ports {IN_weight[32]}]
set_max_capacitance 0.15 [get_ports {IN_weight[31]}]
set_max_capacitance 0.15 [get_ports {IN_weight[30]}]
set_max_capacitance 0.15 [get_ports {IN_weight[29]}]
set_max_capacitance 0.15 [get_ports {IN_weight[28]}]
set_max_capacitance 0.15 [get_ports {IN_weight[27]}]
set_max_capacitance 0.15 [get_ports {IN_weight[26]}]
set_max_capacitance 0.15 [get_ports {IN_weight[25]}]
set_max_capacitance 0.15 [get_ports {IN_weight[24]}]
set_max_capacitance 0.15 [get_ports {IN_weight[23]}]
set_max_capacitance 0.15 [get_ports {IN_weight[22]}]
set_max_capacitance 0.15 [get_ports {IN_weight[21]}]
set_max_capacitance 0.15 [get_ports {IN_weight[20]}]
set_max_capacitance 0.15 [get_ports {IN_weight[19]}]
set_max_capacitance 0.15 [get_ports {IN_weight[18]}]
set_max_capacitance 0.15 [get_ports {IN_weight[17]}]
set_max_capacitance 0.15 [get_ports {IN_weight[16]}]
set_max_capacitance 0.15 [get_ports {IN_weight[15]}]
set_max_capacitance 0.15 [get_ports {IN_weight[14]}]
set_max_capacitance 0.15 [get_ports {IN_weight[13]}]
set_max_capacitance 0.15 [get_ports {IN_weight[12]}]
set_max_capacitance 0.15 [get_ports {IN_weight[11]}]
set_max_capacitance 0.15 [get_ports {IN_weight[10]}]
set_max_capacitance 0.15 [get_ports {IN_weight[9]}]
set_max_capacitance 0.15 [get_ports {IN_weight[8]}]
set_max_capacitance 0.15 [get_ports {IN_weight[7]}]
set_max_capacitance 0.15 [get_ports {IN_weight[6]}]
set_max_capacitance 0.15 [get_ports {IN_weight[5]}]
set_max_capacitance 0.15 [get_ports {IN_weight[4]}]
set_max_capacitance 0.15 [get_ports {IN_weight[3]}]
set_max_capacitance 0.15 [get_ports {IN_weight[2]}]
set_max_capacitance 0.15 [get_ports {IN_weight[1]}]
set_max_capacitance 0.15 [get_ports {IN_weight[0]}]
set_max_fanout 10 [get_ports {IN_character[31]}]
set_max_fanout 10 [get_ports {IN_character[30]}]
set_max_fanout 10 [get_ports {IN_character[29]}]
set_max_fanout 10 [get_ports {IN_character[28]}]
set_max_fanout 10 [get_ports {IN_character[27]}]
set_max_fanout 10 [get_ports {IN_character[26]}]
set_max_fanout 10 [get_ports {IN_character[25]}]
set_max_fanout 10 [get_ports {IN_character[24]}]
set_max_fanout 10 [get_ports {IN_character[23]}]
set_max_fanout 10 [get_ports {IN_character[22]}]
set_max_fanout 10 [get_ports {IN_character[21]}]
set_max_fanout 10 [get_ports {IN_character[20]}]
set_max_fanout 10 [get_ports {IN_character[19]}]
set_max_fanout 10 [get_ports {IN_character[18]}]
set_max_fanout 10 [get_ports {IN_character[17]}]
set_max_fanout 10 [get_ports {IN_character[16]}]
set_max_fanout 10 [get_ports {IN_character[15]}]
set_max_fanout 10 [get_ports {IN_character[14]}]
set_max_fanout 10 [get_ports {IN_character[13]}]
set_max_fanout 10 [get_ports {IN_character[12]}]
set_max_fanout 10 [get_ports {IN_character[11]}]
set_max_fanout 10 [get_ports {IN_character[10]}]
set_max_fanout 10 [get_ports {IN_character[9]}]
set_max_fanout 10 [get_ports {IN_character[8]}]
set_max_fanout 10 [get_ports {IN_character[7]}]
set_max_fanout 10 [get_ports {IN_character[6]}]
set_max_fanout 10 [get_ports {IN_character[5]}]
set_max_fanout 10 [get_ports {IN_character[4]}]
set_max_fanout 10 [get_ports {IN_character[3]}]
set_max_fanout 10 [get_ports {IN_character[2]}]
set_max_fanout 10 [get_ports {IN_character[1]}]
set_max_fanout 10 [get_ports {IN_character[0]}]
set_max_fanout 10 [get_ports {IN_weight[39]}]
set_max_fanout 10 [get_ports {IN_weight[38]}]
set_max_fanout 10 [get_ports {IN_weight[37]}]
set_max_fanout 10 [get_ports {IN_weight[36]}]
set_max_fanout 10 [get_ports {IN_weight[35]}]
set_max_fanout 10 [get_ports {IN_weight[34]}]
set_max_fanout 10 [get_ports {IN_weight[33]}]
set_max_fanout 10 [get_ports {IN_weight[32]}]
set_max_fanout 10 [get_ports {IN_weight[31]}]
set_max_fanout 10 [get_ports {IN_weight[30]}]
set_max_fanout 10 [get_ports {IN_weight[29]}]
set_max_fanout 10 [get_ports {IN_weight[28]}]
set_max_fanout 10 [get_ports {IN_weight[27]}]
set_max_fanout 10 [get_ports {IN_weight[26]}]
set_max_fanout 10 [get_ports {IN_weight[25]}]
set_max_fanout 10 [get_ports {IN_weight[24]}]
set_max_fanout 10 [get_ports {IN_weight[23]}]
set_max_fanout 10 [get_ports {IN_weight[22]}]
set_max_fanout 10 [get_ports {IN_weight[21]}]
set_max_fanout 10 [get_ports {IN_weight[20]}]
set_max_fanout 10 [get_ports {IN_weight[19]}]
set_max_fanout 10 [get_ports {IN_weight[18]}]
set_max_fanout 10 [get_ports {IN_weight[17]}]
set_max_fanout 10 [get_ports {IN_weight[16]}]
set_max_fanout 10 [get_ports {IN_weight[15]}]
set_max_fanout 10 [get_ports {IN_weight[14]}]
set_max_fanout 10 [get_ports {IN_weight[13]}]
set_max_fanout 10 [get_ports {IN_weight[12]}]
set_max_fanout 10 [get_ports {IN_weight[11]}]
set_max_fanout 10 [get_ports {IN_weight[10]}]
set_max_fanout 10 [get_ports {IN_weight[9]}]
set_max_fanout 10 [get_ports {IN_weight[8]}]
set_max_fanout 10 [get_ports {IN_weight[7]}]
set_max_fanout 10 [get_ports {IN_weight[6]}]
set_max_fanout 10 [get_ports {IN_weight[5]}]
set_max_fanout 10 [get_ports {IN_weight[4]}]
set_max_fanout 10 [get_ports {IN_weight[3]}]
set_max_fanout 10 [get_ports {IN_weight[2]}]
set_max_fanout 10 [get_ports {IN_weight[1]}]
set_max_fanout 10 [get_ports {IN_weight[0]}]
set_max_transition 3 [get_ports {IN_character[31]}]
set_max_transition 3 [get_ports {IN_character[30]}]
set_max_transition 3 [get_ports {IN_character[29]}]
set_max_transition 3 [get_ports {IN_character[28]}]
set_max_transition 3 [get_ports {IN_character[27]}]
set_max_transition 3 [get_ports {IN_character[26]}]
set_max_transition 3 [get_ports {IN_character[25]}]
set_max_transition 3 [get_ports {IN_character[24]}]
set_max_transition 3 [get_ports {IN_character[23]}]
set_max_transition 3 [get_ports {IN_character[22]}]
set_max_transition 3 [get_ports {IN_character[21]}]
set_max_transition 3 [get_ports {IN_character[20]}]
set_max_transition 3 [get_ports {IN_character[19]}]
set_max_transition 3 [get_ports {IN_character[18]}]
set_max_transition 3 [get_ports {IN_character[17]}]
set_max_transition 3 [get_ports {IN_character[16]}]
set_max_transition 3 [get_ports {IN_character[15]}]
set_max_transition 3 [get_ports {IN_character[14]}]
set_max_transition 3 [get_ports {IN_character[13]}]
set_max_transition 3 [get_ports {IN_character[12]}]
set_max_transition 3 [get_ports {IN_character[11]}]
set_max_transition 3 [get_ports {IN_character[10]}]
set_max_transition 3 [get_ports {IN_character[9]}]
set_max_transition 3 [get_ports {IN_character[8]}]
set_max_transition 3 [get_ports {IN_character[7]}]
set_max_transition 3 [get_ports {IN_character[6]}]
set_max_transition 3 [get_ports {IN_character[5]}]
set_max_transition 3 [get_ports {IN_character[4]}]
set_max_transition 3 [get_ports {IN_character[3]}]
set_max_transition 3 [get_ports {IN_character[2]}]
set_max_transition 3 [get_ports {IN_character[1]}]
set_max_transition 3 [get_ports {IN_character[0]}]
set_max_transition 3 [get_ports {IN_weight[39]}]
set_max_transition 3 [get_ports {IN_weight[38]}]
set_max_transition 3 [get_ports {IN_weight[37]}]
set_max_transition 3 [get_ports {IN_weight[36]}]
set_max_transition 3 [get_ports {IN_weight[35]}]
set_max_transition 3 [get_ports {IN_weight[34]}]
set_max_transition 3 [get_ports {IN_weight[33]}]
set_max_transition 3 [get_ports {IN_weight[32]}]
set_max_transition 3 [get_ports {IN_weight[31]}]
set_max_transition 3 [get_ports {IN_weight[30]}]
set_max_transition 3 [get_ports {IN_weight[29]}]
set_max_transition 3 [get_ports {IN_weight[28]}]
set_max_transition 3 [get_ports {IN_weight[27]}]
set_max_transition 3 [get_ports {IN_weight[26]}]
set_max_transition 3 [get_ports {IN_weight[25]}]
set_max_transition 3 [get_ports {IN_weight[24]}]
set_max_transition 3 [get_ports {IN_weight[23]}]
set_max_transition 3 [get_ports {IN_weight[22]}]
set_max_transition 3 [get_ports {IN_weight[21]}]
set_max_transition 3 [get_ports {IN_weight[20]}]
set_max_transition 3 [get_ports {IN_weight[19]}]
set_max_transition 3 [get_ports {IN_weight[18]}]
set_max_transition 3 [get_ports {IN_weight[17]}]
set_max_transition 3 [get_ports {IN_weight[16]}]
set_max_transition 3 [get_ports {IN_weight[15]}]
set_max_transition 3 [get_ports {IN_weight[14]}]
set_max_transition 3 [get_ports {IN_weight[13]}]
set_max_transition 3 [get_ports {IN_weight[12]}]
set_max_transition 3 [get_ports {IN_weight[11]}]
set_max_transition 3 [get_ports {IN_weight[10]}]
set_max_transition 3 [get_ports {IN_weight[9]}]
set_max_transition 3 [get_ports {IN_weight[8]}]
set_max_transition 3 [get_ports {IN_weight[7]}]
set_max_transition 3 [get_ports {IN_weight[6]}]
set_max_transition 3 [get_ports {IN_weight[5]}]
set_max_transition 3 [get_ports {IN_weight[4]}]
set_max_transition 3 [get_ports {IN_weight[3]}]
set_max_transition 3 [get_ports {IN_weight[2]}]
set_max_transition 3 [get_ports {IN_weight[1]}]
set_max_transition 3 [get_ports {IN_weight[0]}]
set_max_delay 20  -from [list [get_ports {IN_character[31]}] [get_ports {IN_character[30]}]     \
[get_ports {IN_character[29]}] [get_ports {IN_character[28]}] [get_ports       \
{IN_character[27]}] [get_ports {IN_character[26]}] [get_ports                  \
{IN_character[25]}] [get_ports {IN_character[24]}] [get_ports                  \
{IN_character[23]}] [get_ports {IN_character[22]}] [get_ports                  \
{IN_character[21]}] [get_ports {IN_character[20]}] [get_ports                  \
{IN_character[19]}] [get_ports {IN_character[18]}] [get_ports                  \
{IN_character[17]}] [get_ports {IN_character[16]}] [get_ports                  \
{IN_character[15]}] [get_ports {IN_character[14]}] [get_ports                  \
{IN_character[13]}] [get_ports {IN_character[12]}] [get_ports                  \
{IN_character[11]}] [get_ports {IN_character[10]}] [get_ports                  \
{IN_character[9]}] [get_ports {IN_character[8]}] [get_ports {IN_character[7]}] \
[get_ports {IN_character[6]}] [get_ports {IN_character[5]}] [get_ports         \
{IN_character[4]}] [get_ports {IN_character[3]}] [get_ports {IN_character[2]}] \
[get_ports {IN_character[1]}] [get_ports {IN_character[0]}] [get_ports         \
{IN_weight[39]}] [get_ports {IN_weight[38]}] [get_ports {IN_weight[37]}]       \
[get_ports {IN_weight[36]}] [get_ports {IN_weight[35]}] [get_ports             \
{IN_weight[34]}] [get_ports {IN_weight[33]}] [get_ports {IN_weight[32]}]       \
[get_ports {IN_weight[31]}] [get_ports {IN_weight[30]}] [get_ports             \
{IN_weight[29]}] [get_ports {IN_weight[28]}] [get_ports {IN_weight[27]}]       \
[get_ports {IN_weight[26]}] [get_ports {IN_weight[25]}] [get_ports             \
{IN_weight[24]}] [get_ports {IN_weight[23]}] [get_ports {IN_weight[22]}]       \
[get_ports {IN_weight[21]}] [get_ports {IN_weight[20]}] [get_ports             \
{IN_weight[19]}] [get_ports {IN_weight[18]}] [get_ports {IN_weight[17]}]       \
[get_ports {IN_weight[16]}] [get_ports {IN_weight[15]}] [get_ports             \
{IN_weight[14]}] [get_ports {IN_weight[13]}] [get_ports {IN_weight[12]}]       \
[get_ports {IN_weight[11]}] [get_ports {IN_weight[10]}] [get_ports             \
{IN_weight[9]}] [get_ports {IN_weight[8]}] [get_ports {IN_weight[7]}]          \
[get_ports {IN_weight[6]}] [get_ports {IN_weight[5]}] [get_ports               \
{IN_weight[4]}] [get_ports {IN_weight[3]}] [get_ports {IN_weight[2]}]          \
[get_ports {IN_weight[1]}] [get_ports {IN_weight[0]}]]  -to [list [get_ports {OUT_character[31]}] [get_ports {OUT_character[30]}]     \
[get_ports {OUT_character[29]}] [get_ports {OUT_character[28]}] [get_ports     \
{OUT_character[27]}] [get_ports {OUT_character[26]}] [get_ports                \
{OUT_character[25]}] [get_ports {OUT_character[24]}] [get_ports                \
{OUT_character[23]}] [get_ports {OUT_character[22]}] [get_ports                \
{OUT_character[21]}] [get_ports {OUT_character[20]}] [get_ports                \
{OUT_character[19]}] [get_ports {OUT_character[18]}] [get_ports                \
{OUT_character[17]}] [get_ports {OUT_character[16]}] [get_ports                \
{OUT_character[15]}] [get_ports {OUT_character[14]}] [get_ports                \
{OUT_character[13]}] [get_ports {OUT_character[12]}] [get_ports                \
{OUT_character[11]}] [get_ports {OUT_character[10]}] [get_ports                \
{OUT_character[9]}] [get_ports {OUT_character[8]}] [get_ports                  \
{OUT_character[7]}] [get_ports {OUT_character[6]}] [get_ports                  \
{OUT_character[5]}] [get_ports {OUT_character[4]}] [get_ports                  \
{OUT_character[3]}] [get_ports {OUT_character[2]}] [get_ports                  \
{OUT_character[1]}] [get_ports {OUT_character[0]}]]
