###################################################################

# Created by write_sdc on Sat Apr 18 22:35:47 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max WCCOM -max_library                               \
fsa0m_a_generic_core_ss1p62v125c\
                         -min BCCOM -min_library                               \
fsa0m_a_generic_core_ff1p98vm40c
set_wire_load_mode top
set_wire_load_model -name G50K -library fsa0m_a_generic_core_ff1p98vm40c
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports clk]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports rst_n]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports in_valid_data]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_data[7]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_data[6]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_data[5]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_data[4]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_data[3]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_data[2]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_data[1]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_data[0]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports in_valid_cmd]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[9]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[8]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[7]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[6]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[5]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[4]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[3]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[2]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[1]}]
set_driving_cell -lib_cell XMD -library fsa0m_a_t33_generic_io_ss1p62v125c     \
-pin O [get_ports {in_cmd[0]}]
set_load -pin_load 0.024119 [get_ports out_valid]
set_load -pin_load 0.024119 [get_ports {out_data[7]}]
set_load -pin_load 0.024119 [get_ports {out_data[6]}]
set_load -pin_load 0.024119 [get_ports {out_data[5]}]
set_load -pin_load 0.024119 [get_ports {out_data[4]}]
set_load -pin_load 0.024119 [get_ports {out_data[3]}]
set_load -pin_load 0.024119 [get_ports {out_data[2]}]
set_load -pin_load 0.024119 [get_ports {out_data[1]}]
set_load -pin_load 0.024119 [get_ports {out_data[0]}]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports in_valid_data]
set_max_capacitance 0.15 [get_ports {in_data[7]}]
set_max_capacitance 0.15 [get_ports {in_data[6]}]
set_max_capacitance 0.15 [get_ports {in_data[5]}]
set_max_capacitance 0.15 [get_ports {in_data[4]}]
set_max_capacitance 0.15 [get_ports {in_data[3]}]
set_max_capacitance 0.15 [get_ports {in_data[2]}]
set_max_capacitance 0.15 [get_ports {in_data[1]}]
set_max_capacitance 0.15 [get_ports {in_data[0]}]
set_max_capacitance 0.15 [get_ports in_valid_cmd]
set_max_capacitance 0.15 [get_ports {in_cmd[9]}]
set_max_capacitance 0.15 [get_ports {in_cmd[8]}]
set_max_capacitance 0.15 [get_ports {in_cmd[7]}]
set_max_capacitance 0.15 [get_ports {in_cmd[6]}]
set_max_capacitance 0.15 [get_ports {in_cmd[5]}]
set_max_capacitance 0.15 [get_ports {in_cmd[4]}]
set_max_capacitance 0.15 [get_ports {in_cmd[3]}]
set_max_capacitance 0.15 [get_ports {in_cmd[2]}]
set_max_capacitance 0.15 [get_ports {in_cmd[1]}]
set_max_capacitance 0.15 [get_ports {in_cmd[0]}]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports in_valid_data]
set_max_fanout 10 [get_ports {in_data[7]}]
set_max_fanout 10 [get_ports {in_data[6]}]
set_max_fanout 10 [get_ports {in_data[5]}]
set_max_fanout 10 [get_ports {in_data[4]}]
set_max_fanout 10 [get_ports {in_data[3]}]
set_max_fanout 10 [get_ports {in_data[2]}]
set_max_fanout 10 [get_ports {in_data[1]}]
set_max_fanout 10 [get_ports {in_data[0]}]
set_max_fanout 10 [get_ports in_valid_cmd]
set_max_fanout 10 [get_ports {in_cmd[9]}]
set_max_fanout 10 [get_ports {in_cmd[8]}]
set_max_fanout 10 [get_ports {in_cmd[7]}]
set_max_fanout 10 [get_ports {in_cmd[6]}]
set_max_fanout 10 [get_ports {in_cmd[5]}]
set_max_fanout 10 [get_ports {in_cmd[4]}]
set_max_fanout 10 [get_ports {in_cmd[3]}]
set_max_fanout 10 [get_ports {in_cmd[2]}]
set_max_fanout 10 [get_ports {in_cmd[1]}]
set_max_fanout 10 [get_ports {in_cmd[0]}]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports in_valid_data]
set_max_transition 3 [get_ports {in_data[7]}]
set_max_transition 3 [get_ports {in_data[6]}]
set_max_transition 3 [get_ports {in_data[5]}]
set_max_transition 3 [get_ports {in_data[4]}]
set_max_transition 3 [get_ports {in_data[3]}]
set_max_transition 3 [get_ports {in_data[2]}]
set_max_transition 3 [get_ports {in_data[1]}]
set_max_transition 3 [get_ports {in_data[0]}]
set_max_transition 3 [get_ports in_valid_cmd]
set_max_transition 3 [get_ports {in_cmd[9]}]
set_max_transition 3 [get_ports {in_cmd[8]}]
set_max_transition 3 [get_ports {in_cmd[7]}]
set_max_transition 3 [get_ports {in_cmd[6]}]
set_max_transition 3 [get_ports {in_cmd[5]}]
set_max_transition 3 [get_ports {in_cmd[4]}]
set_max_transition 3 [get_ports {in_cmd[3]}]
set_max_transition 3 [get_ports {in_cmd[2]}]
set_max_transition 3 [get_ports {in_cmd[1]}]
set_max_transition 3 [get_ports {in_cmd[0]}]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  -max 10  [get_ports in_valid_data]
set_input_delay -clock clk  -min 0  [get_ports in_valid_data]
set_input_delay -clock clk  -max 10  [get_ports {in_data[7]}]
set_input_delay -clock clk  -min 0  [get_ports {in_data[7]}]
set_input_delay -clock clk  -max 10  [get_ports {in_data[6]}]
set_input_delay -clock clk  -min 0  [get_ports {in_data[6]}]
set_input_delay -clock clk  -max 10  [get_ports {in_data[5]}]
set_input_delay -clock clk  -min 0  [get_ports {in_data[5]}]
set_input_delay -clock clk  -max 10  [get_ports {in_data[4]}]
set_input_delay -clock clk  -min 0  [get_ports {in_data[4]}]
set_input_delay -clock clk  -max 10  [get_ports {in_data[3]}]
set_input_delay -clock clk  -min 0  [get_ports {in_data[3]}]
set_input_delay -clock clk  -max 10  [get_ports {in_data[2]}]
set_input_delay -clock clk  -min 0  [get_ports {in_data[2]}]
set_input_delay -clock clk  -max 10  [get_ports {in_data[1]}]
set_input_delay -clock clk  -min 0  [get_ports {in_data[1]}]
set_input_delay -clock clk  -max 10  [get_ports {in_data[0]}]
set_input_delay -clock clk  -min 0  [get_ports {in_data[0]}]
set_input_delay -clock clk  -max 10  [get_ports in_valid_cmd]
set_input_delay -clock clk  -min 0  [get_ports in_valid_cmd]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[9]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[9]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[8]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[8]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[7]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[7]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[6]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[6]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[5]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[5]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[4]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[4]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[3]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[3]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[2]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[2]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[1]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[1]}]
set_input_delay -clock clk  -max 10  [get_ports {in_cmd[0]}]
set_input_delay -clock clk  -min 0  [get_ports {in_cmd[0]}]
set_output_delay -clock clk  -max 10  [get_ports out_valid]
set_output_delay -clock clk  -min 0  [get_ports out_valid]
set_output_delay -clock clk  -max 10  [get_ports {out_data[7]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[7]}]
set_output_delay -clock clk  -max 10  [get_ports {out_data[6]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[6]}]
set_output_delay -clock clk  -max 10  [get_ports {out_data[5]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[5]}]
set_output_delay -clock clk  -max 10  [get_ports {out_data[4]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[4]}]
set_output_delay -clock clk  -max 10  [get_ports {out_data[3]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[3]}]
set_output_delay -clock clk  -max 10  [get_ports {out_data[2]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[2]}]
set_output_delay -clock clk  -max 10  [get_ports {out_data[1]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[1]}]
set_output_delay -clock clk  -max 10  [get_ports {out_data[0]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[0]}]
